hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
<?xml version="1.0" ?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>HDSC</vendor>
    <vendorID>HDSC</vendorID>
    <name>HDSC_HC32M424</name>
    <series>ARMCM4</series>
    <version>1.0</version>
    <cpu>
        <name>CM4</name>
        <revision>r0p1</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0x0</resetValue>
    <resetMask>0x0</resetMask>
    <peripherals>
        <peripheral>
            <name>ADC1</name>
            <description>desc ADC1</description>
            <baseAddress>0x40030000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xB1</size>
            </addressBlock>
            <registers>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STRT</name>
                            <description>desc STRT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR0</name>
                    <description>desc CR0</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F3</resetMask>
                    <fields>
                        <field>
                            <name>MS</name>
                            <description>desc MS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACCSEL</name>
                            <description>desc ACCSEL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLREN</name>
                            <description>desc CLREN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DFMT</name>
                            <description>desc DFMT</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVCNT</name>
                            <description>desc AVCNT</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>RSCHSEL</name>
                            <description>desc RSCHSEL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TRGSR</name>
                    <description>desc TRGSR</description>
                    <addressOffset>0xA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8383</resetMask>
                    <fields>
                        <field>
                            <name>TRGSELA</name>
                            <description>desc TRGSELA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENA</name>
                            <description>desc TRGENA</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGSELB</name>
                            <description>desc TRGSELB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENB</name>
                            <description>desc TRGENB</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHSELRA0</name>
                    <description>desc CHSELRA0</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>CHSELA</name>
                            <description>desc CHSELA</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHSELRB0</name>
                    <description>desc CHSELRB0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>CHSELB</name>
                            <description>desc CHSELB</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AVCHSELR0</name>
                    <description>desc AVCHSELR0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>AVCHSEL</name>
                            <description>desc AVCHSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXCHSELR</name>
                    <description>desc EXCHSELR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>EXCHSEL</name>
                            <description>desc EXCHSEL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTR0</name>
                    <description>desc SSTR0</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR1</name>
                    <description>desc SSTR1</description>
                    <addressOffset>0x21</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR2</name>
                    <description>desc SSTR2</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR3</name>
                    <description>desc SSTR3</description>
                    <addressOffset>0x23</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR4</name>
                    <description>desc SSTR4</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ISR</name>
                    <description>desc ISR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>EOCAF</name>
                            <description>desc EOCAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOCBF</name>
                            <description>desc EOCBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SASTPDF</name>
                            <description>desc SASTPDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <description>desc ICR</description>
                    <addressOffset>0x45</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>EOCAIEN</name>
                            <description>desc EOCAIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOCBIEN</name>
                            <description>desc EOCBIEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISCLRR</name>
                    <description>desc ISCLRR</description>
                    <addressOffset>0x46</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>CLREOCAF</name>
                            <description>desc CLREOCAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLREOCBF</name>
                            <description>desc CLREOCBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRSASTPDF</name>
                            <description>desc CLRSASTPDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYNCCR</name>
                    <description>desc SYNCCR</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xC00</resetValue>
                    <resetMask>0xFF71</resetMask>
                    <fields>
                        <field>
                            <name>SYNCEN</name>
                            <description>desc SYNCEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCMD</name>
                            <description>desc SYNCMD</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCDLY</name>
                            <description>desc SYNCDLY</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR0</name>
                    <description>desc DR0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR1</name>
                    <description>desc DR1</description>
                    <addressOffset>0x52</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR2</name>
                    <description>desc DR2</description>
                    <addressOffset>0x54</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR3</name>
                    <description>desc DR3</description>
                    <addressOffset>0x56</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR4</name>
                    <description>desc DR4</description>
                    <addressOffset>0x58</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>AWDCR</name>
                    <description>desc AWDCR</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x377</resetMask>
                    <fields>
                        <field>
                            <name>AWD0EN</name>
                            <description>desc AWD0EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWD0IEN</name>
                            <description>desc AWD0IEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWD0MD</name>
                            <description>desc AWD0MD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWD1EN</name>
                            <description>desc AWD1EN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWD1IEN</name>
                            <description>desc AWD1IEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWD1MD</name>
                            <description>desc AWD1MD</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AWDCM</name>
                            <description>desc AWDCM</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDSR</name>
                    <description>desc AWDSR</description>
                    <addressOffset>0xA2</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>AWD0F</name>
                            <description>desc AWD0F</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AWD1F</name>
                            <description>desc AWD1F</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AWDCMF</name>
                            <description>desc AWDCMF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
