hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CMP1">
            <name>CMP2</name>
            <description>desc CMP</description>
            <baseAddress>0x4004A010</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CMP1">
            <name>CMP3</name>
            <description>desc CMP</description>
            <baseAddress>0x4004A020</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x6</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="CMP1">
            <name>CMP4</name>
            <description>desc CMP</description>
            <baseAddress>0x4004A030</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x6</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>CMPCR</name>
            <description>desc CMPCR</description>
            <baseAddress>0x4004A100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x19</size>
            </addressBlock>
            <registers>
                <register>
                    <name>DADR1</name>
                    <description>desc DADR1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>desc DATA1</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>desc DATA2</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACR1</name>
                    <description>desc DACR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x101</resetMask>
                    <fields>
                        <field>
                            <name>DAEN</name>
                            <description>desc DAEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALGN</name>
                            <description>desc ALGN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAOC1</name>
                    <description>desc DAOC1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>DAODIS</name>
                            <description>desc DAODIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DADR2</name>
                    <description>desc DADR2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>desc DATA1</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>desc DATA2</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACR2</name>
                    <description>desc DACR2</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x101</resetMask>
                    <fields>
                        <field>
                            <name>DAEN</name>
                            <description>desc DAEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALGN</name>
                            <description>desc ALGN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAOC2</name>
                    <description>desc DAOC2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>DAODIS</name>
                            <description>desc DAODIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
