hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
                <register>
                    <name>STAT</name>
                    <description>desc STAT</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFEE</resetMask>
                    <fields>
                        <field>
                            <name>PWMSF</name>
                            <description>desc PWMSF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMPF</name>
                            <description>desc CMPF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OSF</name>
                            <description>desc OSF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PWMST</name>
                            <description>desc PWMST</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMPST</name>
                            <description>desc CMPST</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OSST</name>
                            <description>desc OSST</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF1</name>
                            <description>desc PORTINF1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF2</name>
                            <description>desc PORTINF2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF3</name>
                            <description>desc PORTINF3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF4</name>
                            <description>desc PORTINF4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF5</name>
                            <description>desc PORTINF5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF6</name>
                            <description>desc PORTINF6</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINST1</name>
                            <description>desc PORTINST1</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINST2</name>
                            <description>desc PORTINST2</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINST3</name>
                            <description>desc PORTINST3</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINST4</name>
                            <description>desc PORTINST4</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINST5</name>
                            <description>desc PORTINST5</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINST6</name>
                            <description>desc PORTINST6</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATCLR</name>
                    <description>desc STATCLR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F0E</resetMask>
                    <fields>
                        <field>
                            <name>PWMSFCLR</name>
                            <description>desc PWMSFCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMPFCLR</name>
                            <description>desc CMPFCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OSFCLR</name>
                            <description>desc OSFCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR1</name>
                            <description>desc PORTINFCLR1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR2</name>
                            <description>desc PORTINFCLR2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR3</name>
                            <description>desc PORTINFCLR3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR4</name>
                            <description>desc PORTINFCLR4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR5</name>
                            <description>desc PORTINFCLR5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR6</name>
                            <description>desc PORTINFCLR6</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN</name>
                    <description>desc INTEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F0E</resetMask>
                    <fields>
                        <field>
                            <name>PWMINTEN</name>
                            <description>desc PWMINTEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPINTEN</name>
                            <description>desc CMPINTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSINTEN</name>
                            <description>desc OSINTEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN1</name>
                            <description>desc PORTININTEN1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN2</name>
                            <description>desc PORTININTEN2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN3</name>
                            <description>desc PORTININTEN3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN4</name>
                            <description>desc PORTININTEN4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN5</name>
                            <description>desc PORTININTEN5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN6</name>
                            <description>desc PORTININTEN6</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLSSEL</name>
                    <description>desc RLSSEL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F00</resetMask>
                    <fields>
                        <field>
                            <name>PORTINRSEL1</name>
                            <description>desc PORTINRSEL1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL2</name>
                            <description>desc PORTINRSEL2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL3</name>
                            <description>desc PORTINRSEL3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL4</name>
                            <description>desc PORTINRSEL4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL5</name>
                            <description>desc PORTINRSEL5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL6</name>
                            <description>desc PORTINRSEL6</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
