hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
                <register>
                    <name>POSR7</name>
                    <description>desc POSR7</description>
                    <addressOffset>0x37</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>POS0</name>
                            <description>desc POS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS1</name>
                            <description>desc POS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS2</name>
                            <description>desc POS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS3</name>
                            <description>desc POS3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS4</name>
                            <description>desc POS4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS5</name>
                            <description>desc POS5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS6</name>
                            <description>desc POS6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSR8</name>
                    <description>desc POSR8</description>
                    <addressOffset>0x38</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POS0</name>
                            <description>desc POS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS1</name>
                            <description>desc POS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS2</name>
                            <description>desc POS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSR9</name>
                    <description>desc POSR9</description>
                    <addressOffset>0x39</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>POS0</name>
                            <description>desc POS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS1</name>
                            <description>desc POS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS2</name>
                            <description>desc POS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS3</name>
                            <description>desc POS3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS4</name>
                            <description>desc POS4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS5</name>
                            <description>desc POS5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS6</name>
                            <description>desc POS6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSRA</name>
                    <description>desc POSRA</description>
                    <addressOffset>0x3A</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>POS0</name>
                            <description>desc POS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS1</name>
                            <description>desc POS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS2</name>
                            <description>desc POS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS3</name>
                            <description>desc POS3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS4</name>
                            <description>desc POS4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS5</name>
                            <description>desc POS5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSRB</name>
                    <description>desc POSRB</description>
                    <addressOffset>0x3B</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>POS0</name>
                            <description>desc POS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS1</name>
                            <description>desc POS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS2</name>
                            <description>desc POS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS3</name>
                            <description>desc POS3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS4</name>
                            <description>desc POS4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS5</name>
                            <description>desc POS5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS6</name>
                            <description>desc POS6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS7</name>
                            <description>desc POS7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSRD</name>
                    <description>desc POSRD</description>
                    <addressOffset>0x3D</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>POS0</name>
                            <description>desc POS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS1</name>
                            <description>desc POS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS2</name>
                            <description>desc POS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS3</name>
                            <description>desc POS3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS4</name>
                            <description>desc POS4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS5</name>
                            <description>desc POS5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS6</name>
                            <description>desc POS6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS7</name>
                            <description>desc POS7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSRE</name>
                    <description>desc POSRE</description>
                    <addressOffset>0x3E</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>POS0</name>
                            <description>desc POS0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS1</name>
                            <description>desc POS1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS2</name>
                            <description>desc POS2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS3</name>
                            <description>desc POS3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS4</name>
                            <description>desc POS4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS5</name>
                            <description>desc POS5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORR0</name>
                    <description>desc PORR0</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR2</name>
                            <description>desc POR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR3</name>
                            <description>desc POR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORR1</name>
                    <description>desc PORR1</description>
                    <addressOffset>0x41</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORR2</name>
                    <description>desc PORR2</description>
                    <addressOffset>0x42</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR2</name>
                            <description>desc POR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR3</name>
                            <description>desc POR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR4</name>
                            <description>desc POR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
