hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
                <register>
                    <name>PCR24</name>
                    <description>desc PCR24</description>
                    <addressOffset>0x450</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSR24</name>
                    <description>desc PFSR24</description>
                    <addressOffset>0x452</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR30</name>
                    <description>desc PCR30</description>
                    <addressOffset>0x460</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSR30</name>
                    <description>desc PFSR30</description>
                    <addressOffset>0x462</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR31</name>
                    <description>desc PCR31</description>
                    <addressOffset>0x464</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSR31</name>
                    <description>desc PFSR31</description>
                    <addressOffset>0x466</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR32</name>
                    <description>desc PCR32</description>
                    <addressOffset>0x468</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSR32</name>
                    <description>desc PFSR32</description>
                    <addressOffset>0x46A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR33</name>
                    <description>desc PCR33</description>
                    <addressOffset>0x46C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSR33</name>
                    <description>desc PFSR33</description>
                    <addressOffset>0x46E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
