hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
                <register>
                    <name>DTR</name>
                    <description>desc DTR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DT</name>
                            <description>desc DT</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DRR</name>
                    <description>desc DRR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DR</name>
                            <description>desc DR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCR</name>
                    <description>desc CCR</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1F1F</resetValue>
                    <resetMask>0x71F1F</resetMask>
                    <fields>
                        <field>
                            <name>SLOWW</name>
                            <description>desc SLOWW</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SHIGHW</name>
                            <description>desc SHIGHW</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>desc CKDIV</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLTR</name>
                    <description>desc FLTR</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0x33</resetMask>
                    <fields>
                        <field>
                            <name>DNF</name>
                            <description>desc DNF</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNFEN</name>
                            <description>desc DNFEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ANFEN</name>
                            <description>desc ANFEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ICG</name>
            <description>desc ICG</description>
            <baseAddress>0x000002C0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
            </addressBlock>
            <registers>
                <register>
                    <name>ICG0</name>
                    <description>desc ICG0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF1FF3</resetMask>
                    <fields>
                        <field>
                            <name>SWDTAUTS</name>
                            <description>desc SWDTAUTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTITS</name>
                            <description>desc SWDTITS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTCKS</name>
                            <description>desc SWDTCKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTWDPT</name>
                            <description>desc SWDTWDPT</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTSLPOFF</name>
                            <description>desc SWDTSLPOFF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTPERI</name>
                            <description>desc SWDTPERI</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICG1</name>
                    <description>desc ICG1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xF1</resetMask>
                    <fields>
                        <field>
                            <name>LKUPDIS</name>
                            <description>desc LKUPDIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD0LVL</name>
                            <description>desc LVD0LVL</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD0DIS</name>
                            <description>desc LVD0DIS</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICG2</name>
                    <description>desc ICG2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>HRCFREQS</name>
                            <description>desc HRCFREQS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HRCSTOP</name>
                            <description>desc HRCSTOP</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICG3</name>
                    <description>desc ICG3</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFC</resetMask>
                    <fields>
                        <field>
                            <name>NMIFCLK</name>
                            <description>desc NMIFCLK</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIFEN</name>
                            <description>desc NMIFEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMITRG</name>
                            <description>desc NMITRG</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIEN</name>
                            <description>desc NMIEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIICGEN</name>
                            <description>desc NMIICGEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICG4</name>
                    <description>desc ICG4</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <register>
                    <name>ICG5</name>
                    <description>desc ICG5</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <register>
                    <name>ICG6</name>
                    <description>desc ICG6</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <register>
                    <name>ICG7</name>
                    <description>desc ICG7</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <register>
                    <name>ICG8</name>
                    <description>desc ICG8</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <register>
                    <name>ICG9</name>
                    <description>desc ICG9</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
