hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
                <register>
                    <name>SEL26</name>
                    <description>desc SEL26</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2A</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL27</name>
                    <description>desc SEL27</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2B</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL28</name>
                    <description>desc SEL28</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2C</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL29</name>
                    <description>desc SEL29</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2D</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL30</name>
                    <description>desc SEL30</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2E</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL31</name>
                    <description>desc SEL31</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2F</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL32</name>
                    <description>desc SEL32</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x30</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL33</name>
                    <description>desc SEL33</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x32</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL34</name>
                    <description>desc SEL34</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x33</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL35</name>
                    <description>desc SEL35</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x34</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL36</name>
                    <description>desc SEL36</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x37</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL37</name>
                    <description>desc SEL37</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL38</name>
                    <description>desc SEL38</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x41</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL39</name>
                    <description>desc SEL39</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x42</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL40</name>
                    <description>desc SEL40</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x43</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL41</name>
                    <description>desc SEL41</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x55</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL42</name>
                    <description>desc SEL42</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x57</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL43</name>
                    <description>desc SEL43</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x100</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL44</name>
                    <description>desc SEL44</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x101</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL45</name>
                    <description>desc SEL45</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x102</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL46</name>
                    <description>desc SEL46</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x103</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL47</name>
                    <description>desc SEL47</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x104</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL48</name>
                    <description>desc SEL48</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x105</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL49</name>
                    <description>desc SEL49</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x106</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL50</name>
                    <description>desc SEL50</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x107</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL51</name>
                    <description>desc SEL51</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x108</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL52</name>
                    <description>desc SEL52</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x109</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL53</name>
                    <description>desc SEL53</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10A</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL54</name>
                    <description>desc SEL54</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10B</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL55</name>
                    <description>desc SEL55</description>
                    <addressOffset>0x138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10C</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL56</name>
                    <description>desc SEL56</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10D</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
