hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
                <register>
                    <name>SEL88</name>
                    <description>desc SEL88</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x147</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL89</name>
                    <description>desc SEL89</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x148</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL90</name>
                    <description>desc SEL90</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x149</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL91</name>
                    <description>desc SEL91</description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x14A</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL92</name>
                    <description>desc SEL92</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x150</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL93</name>
                    <description>desc SEL93</description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x151</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL94</name>
                    <description>desc SEL94</description>
                    <addressOffset>0x1D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x152</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL95</name>
                    <description>desc SEL95</description>
                    <addressOffset>0x1D8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x153</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL96</name>
                    <description>desc SEL96</description>
                    <addressOffset>0x1DC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x154</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL97</name>
                    <description>desc SEL97</description>
                    <addressOffset>0x1E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x155</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL98</name>
                    <description>desc SEL98</description>
                    <addressOffset>0x1E4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x156</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL99</name>
                    <description>desc SEL99</description>
                    <addressOffset>0x1E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x157</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL100</name>
                    <description>desc SEL100</description>
                    <addressOffset>0x1EC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x158</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL101</name>
                    <description>desc SEL101</description>
                    <addressOffset>0x1F0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x159</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL102</name>
                    <description>desc SEL102</description>
                    <addressOffset>0x1F4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x15A</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL103</name>
                    <description>desc SEL103</description>
                    <addressOffset>0x1F8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x186</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL104</name>
                    <description>desc SEL104</description>
                    <addressOffset>0x1FC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x187</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL105</name>
                    <description>desc SEL105</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x188</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL106</name>
                    <description>desc SEL106</description>
                    <addressOffset>0x204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x189</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL107</name>
                    <description>desc SEL107</description>
                    <addressOffset>0x208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x18A</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL108</name>
                    <description>desc SEL108</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x18B</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL109</name>
                    <description>desc SEL109</description>
                    <addressOffset>0x210</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x18C</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL110</name>
                    <description>desc SEL110</description>
                    <addressOffset>0x214</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x18D</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL111</name>
                    <description>desc SEL111</description>
                    <addressOffset>0x218</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x18E</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL112</name>
                    <description>desc SEL112</description>
                    <addressOffset>0x21C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x18F</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL113</name>
                    <description>desc SEL113</description>
                    <addressOffset>0x220</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x190</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL114</name>
                    <description>desc SEL114</description>
                    <addressOffset>0x224</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x191</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL115</name>
                    <description>desc SEL115</description>
                    <addressOffset>0x228</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x192</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL116</name>
                    <description>desc SEL116</description>
                    <addressOffset>0x22C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x193</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL117</name>
                    <description>desc SEL117</description>
                    <addressOffset>0x230</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x194</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL118</name>
                    <description>desc SEL118</description>
                    <addressOffset>0x234</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x195</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
