hdscmcu/pyOCD/pyocd/debug/svd/data/HC32M424.svd
                <register>
                    <name>SEL119</name>
                    <description>desc SEL119</description>
                    <addressOffset>0x238</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x196</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL120</name>
                    <description>desc SEL120</description>
                    <addressOffset>0x23C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x197</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL121</name>
                    <description>desc SEL121</description>
                    <addressOffset>0x240</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x198</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL122</name>
                    <description>desc SEL122</description>
                    <addressOffset>0x244</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x199</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL123</name>
                    <description>desc SEL123</description>
                    <addressOffset>0x248</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x19A</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL124</name>
                    <description>desc SEL124</description>
                    <addressOffset>0x24C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x19B</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL125</name>
                    <description>desc SEL125</description>
                    <addressOffset>0x250</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x19C</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL126</name>
                    <description>desc SEL126</description>
                    <addressOffset>0x254</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A0</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL127</name>
                    <description>desc SEL127</description>
                    <addressOffset>0x258</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A1</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL128</name>
                    <description>desc SEL128</description>
                    <addressOffset>0x25C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A2</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL129</name>
                    <description>desc SEL129</description>
                    <addressOffset>0x260</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A3</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL130</name>
                    <description>desc SEL130</description>
                    <addressOffset>0x264</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A4</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL131</name>
                    <description>desc SEL131</description>
                    <addressOffset>0x268</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A5</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL132</name>
                    <description>desc SEL132</description>
                    <addressOffset>0x26C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A6</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL133</name>
                    <description>desc SEL133</description>
                    <addressOffset>0x270</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1A7</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL134</name>
                    <description>desc SEL134</description>
                    <addressOffset>0x274</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1B0</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL135</name>
                    <description>desc SEL135</description>
                    <addressOffset>0x278</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1B1</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL136</name>
                    <description>desc SEL136</description>
                    <addressOffset>0x27C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1B2</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL137</name>
                    <description>desc SEL137</description>
                    <addressOffset>0x280</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1B4</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL138</name>
                    <description>desc SEL138</description>
                    <addressOffset>0x284</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1B5</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL139</name>
                    <description>desc SEL139</description>
                    <addressOffset>0x288</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1B6</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL140</name>
                    <description>desc SEL140</description>
                    <addressOffset>0x28C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1B8</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL141</name>
                    <description>desc SEL141</description>
                    <addressOffset>0x290</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C0</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL142</name>
                    <description>desc SEL142</description>
                    <addressOffset>0x294</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C1</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL143</name>
                    <description>desc SEL143</description>
                    <addressOffset>0x298</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C2</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL144</name>
                    <description>desc SEL144</description>
                    <addressOffset>0x29C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C3</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL145</name>
                    <description>desc SEL145</description>
                    <addressOffset>0x2A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C4</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL146</name>
                    <description>desc SEL146</description>
                    <addressOffset>0x2A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C5</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL147</name>
                    <description>desc SEL147</description>
                    <addressOffset>0x2A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C6</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL148</name>
                    <description>desc SEL148</description>
                    <addressOffset>0x2AC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C7</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEL149</name>
                    <description>desc SEL149</description>
                    <addressOffset>0x2B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1C9</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>ISEL</name>
                            <description>desc ISEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
